import os
import psycopg2
from psycopg2 import Error

def lineStartsWithCapitalLetter(line) -> bool:
    alphabet = list("АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЭЮЯ")
    if line[0] in alphabet:
        return True
    return False

# Checks whether line begins with capitalized russian word or not.
def lineStartsWithCapitalizedWord(line) -> bool:
    wordsInLine = line.split(" ")
    word = wordsInLine[0]
    if word.isupper():
        if len(word) > 2:
           return True
    return False

# Удаляем все строки котоыре после отсечения пробелов и табуляций превращаются в пустую строку
def dropEmptyLines(fw, pathToFile, sourceEncoding) -> None:
    with open(pathToFile, 'rt', encoding=sourceEncoding) as fr:
        for line in fr:
            if len(line.strip()) > 0:
                fw.write(line)

"""
заменяем все символы, которые распознались латиницей на русские буквы схожие по написанию.
здесь применяем только к буквам в верхнем регистре.
"""
def replaceSimilarLetters(fw, pathToFile, sourceEncoding) -> None:
    with open(pathToFile, 'rt', encoding=sourceEncoding) as fr:
        for line in fr:
            newLine = line.replace("...", "…").replace("O", "О").replace("X", "Х").replace("P", "Р").replace("B", "В").replace("Y","У").replace("H", "Н").replace("A", "А").replace("C", "С").replace("E", "Е").replace("K", "К").replace("M", "М").replace("T", "Т").replace("СМ.", "см.")
            fw.write(newLine)

"""
Пропускаем первые skipLines строк и 
объединяем все соседние строки в одну если последующие строки относятся к слову из первой строки. 
В итоге должны получить документ в котором в начале строки находится трактуемое слово
"""
def concatLines(fw, skipLines, pathToFile, sourceEncoding) -> None:
    with open(pathToFile, 'rt', encoding=sourceEncoding) as fr:
        for i in range(0,skipLines):
            fw.write(fr.readline())

        currentLetter = ''
        for line in fr:
            # --- предварительные проверки главной строки
            strippedLine = line.strip()
            #print("---Stripped line:" + strippedLine)
            if len(strippedLine) == 1: # в этом случае это переключение на новую букву
                currentLetter = strippedLine[0]
                # print("New letter:" + currentLetter, strippedLine)
                continue
            elif len(strippedLine) == 0: # значит файл закончился
                #print("!!!!End of file")
                return

            checkFollowingLines = True
            while checkFollowingLines:
                # --- предварительные проверки последующих строк которые в том числе потенциально могут быть частью главной строки
                nextLine = fr.readline()
                strippedNextLine = nextLine.strip()
                #print("Stripped next line:" + strippedNextLine)
                if len(strippedNextLine) == 0: #значит документ закончился и строк более нет
                    #print("!!!!End of file inside next line")
                    fw.write(strippedLine)
                    return
                if len(strippedNextLine) == 1: #значит начинается новая буква
                    currentLetter = strippedNextLine[0]
                    fw.write(strippedLine)
                    fw.write('\n')
                    # print("Новая буква в next line:", currentLetter, strippedLine)
                    break

                # ---------------------------------------------------------------------------------
                # --- с этого момента обрабатываем обычную строку (НЕ новая буква, НЕ конец файла)
                # ---------------------------------------------------------------------------------
                if strippedNextLine[0] != currentLetter[0]: # следующая считанная строка отличается от текущей буквы по которой обрабатываем
                    #print("Первые буквы неравны:", strippedNextLine, currentLetter)
                    if strippedLine.find("\r\n") != -1:
                        strippedLine = strippedLine.replace("\r\n", " ") + strippedNextLine
                    else:
                        strippedLine = strippedLine.replace("\n", " ") + strippedNextLine
                else:
                    #print("Первые буквы равны:", strippedNextLine, strippedLine)
                    fw.write(strippedLine)
                    fw.write('\n')
                    strippedLine = strippedNextLine
                    checkFollowingLines = True

"""
Ищем подозрительно короткие строки которые потенциально могут указывать на то что пояснение к слову может быть разбито на несколько строк
"""
def findInconsistencies(pathToFile, skipLines, sourceEncoding) -> None:
    with open(pathToFile, 'rt', encoding=sourceEncoding) as fr:
        for i in range(0,skipLines):
            fr.readline()
        counter = 0
        words = ""
        for line in fr:
            if len(line) < 50:
                if line.find("см.") == -1:#законно короткие строки которые лишь отсылают к объяснению в другом слове
                    current_word = extractFirstWordFromLine(line)
                    if current_word in ("ЭТОЛОГ","ЮАНЬ","ЯСТРЕБИЦА","ФУРОР","ХВОИНКА","ХЛЕБОПЁК","ХРОНИК","ЦАРЕВИЧ","ЦАРЕУБИЙСТВО","ЦАРЕУБИЙЦА","ЦЕСАРКА","ЦИНИК","ЧЕРНОЛЕСЬЕ","ЧЕЧЕТ",
                                        "ЧУПРИНА","ШАХИНЯ","ШИП","ШЛЮПЯК","ШУРИН","ЩЕГЛОВКА","ЩУРОК","ЭКОЛОГ","ЭССЕИСТ",
                                        "УТЫКАТЬ","УФОЛОГ","УШКО","УЧИНИТЬ","УЩИПНУТЬ","ФАТ","ФАТОВСТВО","ФИГЛЯРИТЬ","ФИГЛЯРНИЧАТЬ","ФИЗИК","ФОЛЬГА","ФОНОТЕКАРЬ","ФОРТЕПИАНО","ФОРТОЧКА",
                                        "УТОНЧЁННЫЙ","УПАКОВАТЬ","УПАСТЬ","УПРАШИВАТЬ","УРЫВАТЬ","УСОВЕСТИТЬ","УТЕРЯТЬ","УСЫЛАТЬ","УТОНУТЬ","УТОНЧЁННЫЙ",
                                        "ТРИППЕР", "ТЮЛЕНИНА", "ТЯЖЕЛОДУМ", "УЖАК", "УКЛАДОЧНЫЙ", "УКЛАДЫВАТЬСЯ",
                                        "УЛАВЛИВАТЬ", "УЛИЦЕЗРЕТЬ", "УМКА", "УМОРИТЬ", "УМОТАТЬ","СВЁКОР","СВИНИНА","СВИЯЗЬ","СВОЯЧЕНИЦА","СДАВАТЬ","СЕРПЕНТАРИЙ","СИВУЧИХА","СИЗАРЬ",
                                        "СИПОТА","СКВОРЧИХА","СКОМОРОШЕСТВО","СКОНДЕНСИРОВАТЬ","СКРЕПЕРИСТ","СКУПЕЦ","СЛОНИХА","СОКРУШЕНИЕ","СОСНЯК","СОЧНИК","СПЕВКА","СТАРКА","СТОЧНЫЙ",
                                        "СУРА","СУХОГРУЗ","СЪЕЗЖАТЬ","ТЕЛЯТНИК","ТЕСИНА","ТЕТЁРКА","ТИГРИЦА","ТОКОВИШЕ","РАБОТОРГОВЛЯ","РАЗДИРАТЬСЯ","РАЗДОБРЕТЬ","РАЗДРОБИТЬ","РАЗДРОБИТЬСЯ",
                                        "РАЗЕВАТЬ","РАНЕТ","РАСЧЁТНЫЙ","РЕШЁТЧАТЫЙ","РЕЯ","РОДИЛЬНЫЙ","РЫЖИНА","РЫСИХА","РЯБИННИК","РЯЖЕНКА",
                                        "ПАСОЧНЫЙ", "ПЕНС", "ПЕРЕГОНЯТЬ", "ПЕРЕПЕЛИЦА", "ПЕСТИК", "ПЕСЧИНКА", "ПЛИ",
                                        "ПЛОТОВОД", "ПОДРАЗДЕЛ", "ПОДТЁЛОК", "ПО-ЛАТЫНИ", "ПОЛОВА", "ПОЛУЗАЩИТНИК", "ПООБЕДАТЬ",
                                        "ПООБЕЩАТЬ", "ПОПЕРЕЧИНА", "ПОПОЛНЕТЬ", "ПРАВНУК", "ПРЕФЕРАНС", "ПРИЧАСТНЫЙ",
                                        "ПРОБАСИТЬ", "ПРОКАПЫВАТЬ", "ПРОТРУБИТЬ", "ПРУСАК", "ПРЫГАЛКИ", "ПРЯДИЛЬНЫЙ",
                                        "ПУДРЕНИЦА", "ПУЗАНОК", "ПУШЕЧНЫЙ", "ПЫЛИНКА",
                                        "ОДНОКОЛКА", "ОКРОЛ", "ОЛЕНУХА", "ОПЛОШАТЬ", "ОРЛИЦА", "ОСЕНЬЮ", "ОСИННИК", "ОСЛИЦА", "ОСНОВНЫЙ", "ОСТРОГУБЦЫ",
                                        "НЕРЕСТИЛИЩЕ", "НЕСУШКА", "НЕФРИТ",
                                        "МАНКА", "МАРОДЁРСТВО", "МАЯЧНИК", "МГА", "МЕДВЕДИЦА", "МЕДОВУХА", "МЕДОНОС",
                                        "МЕДЯК", "МЕЧЕТЬ", "МИНДАЛИНА", "МОЛИТВЕННИК", "МОЛОДЕЧЕСТВО", "МОРОСЬ",
                                        "МУЛИЦА",
                                        "КАБАНИХА", "КАЗАЧЕСТВО", "КАЗАЧКА", "КАЛОРИЯ", "КАМСА", "КАСКЕТКА", "КВАКША",
                                        "КЛИП", "КНУТОВИЩЕ","КНЯГИНЯ","КОЗЛЯТИНА","КОЗУЛЯ","КОК","КОНИНА","КОННИЦА","КОНОКРАДСТВО",
                                        "КОНФЕТНИЦА","КОРОВНИК","КОСЕЦ","КОСИЛКА","КОСОГОР","КОФЕЙНИК","КОШАТИНА","КРЕСТНИК",
                                        "КРЕСТНИЦА","КРОЛЬЧИХА","КУГУАР","КУКАРЕКУ","КУ-КУ","ЛАВКА","ЛАЗИТЬ","ЛАМА","ЛАТИНИЦА",
                                        "ЛЕТОМ","ЛИМИТА","ЛИТОВКА","ЛОЖКОРЕ","ЛОСИХА","ЛОСЯТИНА","ЛЬДИНА",
                                        "ИЗДАЛИ", "ИМПОТЕНЦИЯ",
                                        "ЖАТКА", "ЖЕМАНСТВО", "ЖНЕЙКА", "ЖОР", "ЖРАТВА", "ЗАЙЧАТИНА", "ЗАЙЧИХА",
                                        "ЗАКРЕПИТЕЛЬ", "ЗАПЛАТКА", "ЗОЛОВКА", "ЗООЛОГ", "ЗРЯЧИЙ",
                                        "ГУЩИНА", "ДВУСТВОЛКА", "ДЕКАБРИСТКА", "ДЕРГАЧ", "ДИСКЕТКА", "ДОЖДИНКА",
                                        "ДУБНЯК", "ДУРАНДА", "ДУХАНЩИК", "ДЬЯЧИХА", "ЕЖИХА",
                                        "ГЕОЛОГ", "ГЛУПЕЦ", "ГОЛОВЕШКА", "ГРУЗОВИК", "ГУСЫНЯ", "ГУСЯТИНА",
                                        "БУЙВОЛЁНОК", "БУЙВОЛИЦА", "ВБОК", "ВЕРБЛЮДИЦА", "ВЕСНОЙ", "ВИДЕО", "ВИНТ",
                                        "ВНУЧКА", "ВОНА", "ВПОСЛЕДСТВИИ", "ВПЯТЕРО", "ВСЕМЕРО", "ВТРОЕ", "ВЫЖЛЕЦ",
                                        "АУКЦИОНЕР", "БАЛЕРИНА", "БАРАНИНА", "БАСМА", "БАТРАЧЕСТВО", "БЕЛОРЫБИЦА",
                                        "БЕЛОШВЕЙКА", "БИНОМ", "БИОЛОГ", "БИРЖЕВИК", "БОРОВИК", "БРАКЁР",
                                        "АВИАПОЧТА", "АИСТИХА",
                                        ):
                        continue
                    words = words + '"'+ current_word +'",'
                    print('"' + current_word + '",  ' + line)
                    counter = counter + 1
        print("Total:", counter)
        print(words)


"""
Разбирает каждую строку по словам и проверяем нет ли в строке слов в верхнем регистре длиной более 2 символов.
Если есть, то расчленяет исходную строку на несколько.
"""
def extractInlinedWords(fw, pathToFile, sourceEncoding) -> None:
    with open(pathToFile, 'rt', encoding=sourceEncoding) as fr:
        for line in fr:
            firstWord = extractFirstWordFromLine(line)
            wordsInLine = line.strip().split(" ")
            for word in wordsInLine:
                clearedWord = extractWordFromString(word)
                if clearedWord.isupper():
                    if firstWord in ("АББРЕВИАТУРА", "АВСТРОАЗИАТСКИЙ", "АВТОМАТИЗИРОВАТЬ", "АЖ", "АЙ", "АМЕРИКАНСКИЙ", "АНТИСОВЕТИЗМ",
                                     "АПАЧИ", "АССИРИЙЦЫ", "АССОРТИМЕНТ", "БАКС", "БАЮ-БАЙ", "БАЯДЕРА", "БЕЙ", "БЕЛО…", "БЕРЁСТА", "БЫЧАЧИЙ",
                                     "ЭПИЛЕПСИЯ", "ЭЛЕКТРОННО-ВЫЧИСЛИТЕЛЬНЫЙ", "ЭГЕ", "ЭНПИКЛОПЕДИЧНЫЙ", "ЭЗОПОВСКИЙ", "ЯРКО…", "СЕНАТ", "БАЙ",
                                     "АНГЛО…", "АПОПЛЕКСИЯ", "БАЗИЛИКА", "БАРХАТКА", "ЯРЫГА", "ЯХТ…", "ЯЗЫКОЗНАНИЕ", "ЯГОДИЦА", "ШКВОРЕНЬ", "ШИЛОХВОСТЬ",
                                     "ШВОРЕНЬ", "ЧТОБ", "ЧИСТО-…", "ЧИК-ЧИРИК", "ЧИНАРА", "ЧЕРНОБЫЛЬНИК", "ЧЕРНО…", "ЧЕРВИ", "ЧЕЛОВЕКО…", "ЧАРДАШ",
                                     "ЦИДУЛЬКА", "ЦЕРКОВНО…", "ХО-ХО", "ХИ-ХИ", "ХИБАРА", "ХЕ-ХЕ", "ХВОРЬ", "ХАОС", "ХАНЖЕСТВО", "ХА-ХА", "ХАЛЯВА", "ХАЛДА",
                                     "ФЬОРД", "ФРАНКО…", "ФЛАНЕЛЕВКА", "ФЛАГ…", "ФИЗИКА", "ФИГА", "УШКО", "УТРАМБОВАТЬ", "УРИЛЬНИК", "УПЛАТА", "УКСУСНИК", "УЖЕЛИ",
                                     "УДЭХЭ", "УДАЛЬ", "УДАЛОЙ", "УГОН", "УГОЖДАТЬ", "УВОД", "УБОРКА", "УАЗИК", "ТЮНИК", "УТРАМБОВАТЬ","УСАДИТЬ","ТУТОВНИК","УТРАМБОВАТЬ",
                                     "ТОННЕЛЬ","ТРУТНИК","ТРЁШНИЦА","ТРЁШКА","ТРАПЕЗА","ТОТЧАС","ТОРЦЕВОЙ","ТОРФЯНИК","ТОРЕАДОР","ТОЖДЕСТВО","ТОВАРО…","ТЁША",
                                     "ТЕМНО…","ТЕЛЬНИК","ТВОРОГ","ТАРАТОРА","ТАНДЕМ","ТАБУРЕТ","СЫРОМЯТЬ","СЫЗМАЛА","СЧЁТНО…","СХАЛТУРИТЬ","СУ","СУРДИНА",
                                     "СУПОРОСАЯ","СТЮАРД","СТУДЕНИ","СТРОГАЛЬ","СТРИГУН","СТОРИЦЕЙ","СТОГОВАНИЕ","СТЕРНЯ","СТЕБЛИ","СТАНОВИЩЕ",
                                     "СТАЙКА","СРЫВ","СПЬЯНА","СПРОСОНОК","СПОЗАРАНКУ","СПЕРВОНАЧАЛА","СПАЗМ","СОУСНИК","СОСЛЕПА","СОРТАМЕНТ",
                                     "СОМО","СМЫ","ТУТА","ТУННЕЛЬ","СЫЗМАЛА","СЫРОМЯТЬ","СУПОРОСАЯ","СТОРИЦЕЙ","СТАНОВИЩЕ",
                                     "СРЫВ","СПЬЯНА","СОСЛЕПА","СОРТАМЕНТ","СМЁТКА","СМЕСИТЬ","СЛЫШЬ","СЛАЗИТЬ","СЛАБО…","СКАРЕД","СИММЕТРИЯ",
                                     "СИДМЯ","СИВКО","СЕЛИЩЕ","СГОН","СВОЗ","СВИТА","СВИНУХА","СВЕТОВОД","СВЕТЛЯК","САРДИНА","САМОСЕЙ","САЛЬТО",
                                     "САЛАТНИК","САЙГАК","САДНИТЬ","СВЕТЛО…","РЮШ","РЭКЕТИР","РЫБОНАДЗОР","РЭКЕТ","РЫБАРЬ","РУГНЯ","МАФИОЗИ",
                                     "РЭКЕТ", "РОЗАНЧИК","ПРОФЕССИОНАЛЬНО-ТЕХНИЧЕСКИЙ","ПСАЛТЫРЬ","ПУРПУРНО-…","РАЗВИЛКА","РАЗЖИМНОЙ","ПРОМЫСЛ",
                                     "ПРОСАДКА","ПРОСЫП","ПРОПОЛИС","ПРИПАЛИВАТЬ","ПРИСЫЛАТЬ","ПРОСЕКА","РАЗВОЗКА","ПРИНОС","РОЗГОВЕНЬЕ","РОЖЕНИЦА",
                                     "РАЗЪЁМ","ПРИКОРМ","РАКУРС","РАКУШЕЧНИК","РОВНЯ","РОГАЛИК","РЕФЕРИ","ПРИЖИВАЛ","ПРИЕЗД","ПРИГОН","ПРИВОД","РАСФАСОВАТЬ",
                                     "РАСПЛАНИРОВАТЬ","ПРЕДПЛЮСНА","ПРАДЕД","ПОЧИНИТЬ","ПОТОПИТЬ","ПОТЕМНЕНИЕ","ПОСТИЧЬ","ПОСЛУШНИК","ПОСКРЁБКИ","ПОЛИ","ПРАБАБКА",
                                     "ПОСЕДЕНИЕ","ПОРОЙ","ПОПЕРЧИТЬ","ПОМИДОРИНА","ПОЛУНОЧНЫЙ","ПОЛИВ","ПОЛ…","ПОЗЁМКА","ПОДСЫЛ","ПОДСТИЛ","ПОДРЫВ","ПОКРАСИТЬ",
                                     "ПОДРАМНИК","ПОДПОРА","ПОДНОСИТЬ","ПОДКОРМ","ПОДКЛЕТ","ПОДБОЕЧНЫЙ","ПОБРЕЗГАТЬ","ПОБЛЁКНУТЬ","ПО…","ПЛЮСНА","ПИЧУГА",
                                     "ПИЦЦЕРИЯ","ПИЛЯСТРА","ПЕТЛЯ","ПЕСТРЯДЬ","ПЕРИФРА","ПЕРЕСЫЛАТЬ","ПЕРЕЛИЦЕВАТЬ","ПЕРЕЗИМОВАТЬ","ПЕРЕВОЗИТЬ","ПАТРОН",
                                     "ПАТРИАРХИЯ","ПАЛЬБА","ОТЩЕПЕНСТВО","ОТТОЛЕ","ОТСЫЛАТЬ","ОТСЕЛЕ","ОТСВЕТ","ОТРЫВ","ОТКОЛЕ","ОТЗЫВ","ОТБОЙКА","ОСЛИК",
                                     "ОРТОПЕДИЯ","ОРГАНО…","ОРАНГУТАН","ОПЬЯНЕНИЕ","ОЛИВА","ОЛЕНИНА","ОКОЛЕСИЦА","ОКЕАНАРИУМ","ОТГОНКА","ОЙ","ОЖИРЕНИЕ",
                                     "ОГРАДИТЬ","ОВСЯНОЙ","ОВЕВАТЬ","ОБЩИНА","ОБХОДНЫЙ","ОБУХ","ОБТИРКА","ОБТИРАТЬ","ОБРЕЗАНИЕ","ОБДИРАТЬ","ОБГОННЫЙ","ОБГОН",
                                     "ОБВОДНЫЙ","ОБВОДКА","ОБВОДИТЬ","НЬЮФАУНДЛЕНД","НЬЮТОН","НУТЕ","НУЛИК","НОЛЬ","НИОТКОЛЕ","НЕУМЁХА","НАШКОДИТЬ","НАХУЛИГАНИТЬ",
                                     "НАСТЫТЬ","НАСТИЧЬ","НАСТИЛ","НАСТИГАТЬ","НАРТЫ","НАПРОКАЗНИЧАТЬ","НАПЕРЧИТЬ","НАПЕРЕГОНКИ","НАНСУК","НАМУСЛИТЬ","НАМИНКА",
                                     "НАШКОДИТЬ","НАКАВЕРЗИТЬ","НАЗЛО","НАДОЕДА","НАГОЛО","НАВЫКАТ","НАВЕРШИЕ","НАВЕРНО","НАВЕК","МЯСО…","МЫШЛЕНИЕ",
                                     "МЫШИЙ","МУЧИЦА","МУРАШ","МУЖНИЙ","МОТКА", "МОРФИЙ","МОРДОБОЙ","МНОГОЛЮДСТВО","МИРТ","МИКРОКОСМ","МЕТАЛЛУРГИЯ",
                                     "МЕЛЬКОМ","МАШИНО…","МАТРАС","МАСЛО…","МАНГУСТ","МАЛОЛЮДЬЕ","МАКРОКОСМ","ЛУЧОК","ЛОХАНКА","ЛОСОСЬ","ЛОЖЕ","ЛОГОВИЩЕ",
                                     "ЛИШАЙ","ЛУЧОК","ЛИТАВРИСТ","ЛАСА","ЛАМПАДА","ЛАКРИЦА","КШ","КУЛИНАРИЯ","КРЕЩЕНДО","КРАЮШКА","КРАСНО…",
                                     "КРАПИНА","КОТЯТА","КОРОТЫШ","КОНСКИЙ","КОНДРАТИЙ","КОМБАЙНЕР","КОЛОТЬЁ","КРИНКА","КОНСКИЙ","КОЛЛЕДЖ","КОЛИ",
                                     "КОЕ-КОГДА","КОНСКИЙ","КОЕ-КАК","КОЕ-ГДЕ","КОЕ…","КОБЗА","КЛИМАКС","КЛЕЩИ","КЛАКСОН","КИРКА","КИРЗА","КИЗИЛ",
                                     "КЕТГУТ","КЕТА","КЕНАРЬ","КВАКУША","КАРМАННИК","КАРБАС","КАРАТЭИСТ","КАПРИЧЧИО","КАМЫШЕВКА","КАМФАРА","КАК-НИБУДЬ",
                                     "КАЙФ","КАЙЛО","КАБАЛИСТИКА","ИТАЛО…","КАЛМЫКИ","ИСКУС","ИНАЧЕ","ИЗЮБР","ИЗДАЛЕКА","ЗУДЕТЬ","ЗУБРИЛА","ЗОРЕНЬКА",
                                     "ЗЛЮКА","ЗВЕРЁНЫШ","ЗАТУШЕВАТЬ","ЗАСЫЛАТЬ","ЗАСТЫТЬ","ЗАСТРУГАТЬ","ЗАСТРУГА","ЗАСТИЧЬ","ЗАРЖАВЕТЬ",
                                     "ЗАПАКОВАТЬ","ЗАПАИВАТЬ","ЗАМУСЛИТЬ","ЗАМОЧИТЬ","ЗАКУТКА","ЗАКУТ","ЗАКАВЫКА","ЗАЖИМАНИЕ","ЗАДЕШЕВО",
                                     "ЗАВОЗ","ЗАВАРУХА","ЗАБОРОНИТЬ","ЖИРАФ","ЖЁЛЧЬ","ЖЕСТЯНЩИК","ЖЕРЛИЦА","ЖВАЛА","ЖЕЛАТИН","ЕКТЕНИЯ","ДУМНЫЙ","ДОСЫТА",
                                     "ДОСЫЛАТЬ","ДОСЫЛ","ДОПЬЯНА","ДОМОУПРАВ","ДОКРАСНА","ДОКОЛЕ","ДОБЕРМАН","ДИФТЕРИТ","ДИСКАНТ","ДИКОВИНА","ДЕЛЁЖ","ДЖЕРСИ",
                                     "ДВУ…","ДВОРНЯГА","ДОБЕЛА","ГУСТО…","ГРУЗО…","ГРЕБЛЯ","ГОРНО…","ГРЕЙПФРУТ","ГОРЛИНКА","ГОРЖЕТ","ГЕРМАНО…","ГАДАНИЕ",
                                     "ВЫСЫЛАТЬ","ВЫСТРОГАТЬ","ВЫСЕВАТЬ","ВЫМИРАНИЕ","ВЫЛЕЗТИ","ВЫДЫХАТЕЛЬНЫЙ","ВЫДЫХАНИЕ","ВЫДУВКА","ВЫВОЗКА","ВЫВОЗ",
                                     "ВТИХАРЯ","ВСПОМОЖЕНИЕ","ВОЛЬЕРА","ВОВЕК","ВНАЙМЫ","ВЛАСТЕЛИН","ВИЧ","ВИТЮТЕНЬ","ВЗРЫХЛЕНИЕ","ВЗАШЕЙ",
                                     "ВЕСЕЛЬНЫЙ","ВЕЗУНЧИК","ВДЫХАНИЕ","ВВОДНЫЙ","ВВОЗ","ВАЛЕРИАНА","ВАКУУМ…","БРОШКА","БРАТЕЛЬНИК","БОРДО",
                                     "БОНДАРЬ","БЛОК…","БЛЕДНО…","БИТЛЫ","БИВАК","БЕЛЬЕВЩИЦА","БЕЖ","БАШЕНКА","АВТАРКИЯ","БЕРЕЗНЯК", "БИТЛЗ", "ЯЗЫКАСТЫЙ",
                                     "ЮРКНУТЬ","ЩУЧИТЬ","ШТАБС-РОТМИСТР","ШПАКЛЁВКА","ЧУВАШИ","ЧЕРКАТЬ","ЧЕПЕ","УДЭГЕЙСКИЙ","ТЯТЯ","ОХРЕННЫЙ",
                                     "ТЕРРАРИУМ", "СЛЕДОВАТЕЛЬНО","ТРЕТЬЁВОДНИЩНИЙ","ШЕЛЬМА","ЧЕКА","ФОРДЫБАЧИТЬ","СОЛЬФЕДЖИО","СГОВОР",
                                     "САЛАТНЫЙ","РИТМИЗИРОВАТЬ","ХОЛЕНЫЙ","УСТЛАТЬ","УПРОЩЕНЧЕСТВО","СУМАСБРОДСТВОВАТЬ","СТРЕМЯННЫЙ","СТЛАТЬ",
                                     "СТАЖИРОВАТЬ","СТИХОТВОРСТВО","СКВАЖИСТЫЙ","СКВАЛЫГА","ШАРОМЫГА","ХАНЖЕСКИЙ","ЩЕПОТЬ","ШЛЯХТА","ШКОДИТЬ",
                                     "ШЕРСТОБИТНЫЙ","ЧАЛКА","ЧАВЫЧА","ЦЫГАНЕ","ЦЕЛЬНОКРОЕНЫЙ","ФОРТОЧКА","ФОРТЕПИАНО","ФОЛЬГА","ФИГЛЯРИТЬ","УНТЫ",
                                     "УНАВОЖИВАТЬ","УДОРОЖАНИЕ","ТРАПЕЗНАЯ","ТОРЧКОМ","ТОНКОШЁРСТНЫЙ","ТОЖДЕСТВЕННЫЙ","ТЕФТЕЛИ","СУПЕСОК","СТРОГАТЬ",
                                     "СТРАШИЛО","СТАВЕНЬ","СРЕДНЕВОЛНОВЫЙ","СУМАТОШЛИВЫЙ","СТЫТЬ","СПОТКНУТЬСЯ","СОСТРОГАТЬ","СОЛЕВАРНЯ","СНОРОВИСТЫЙ",
                                     "СМИЛОВАТЬСЯ","СОЛДАТНЯ","СКОРОМИТЬСЯ","СКИРД","СКВОРЕЧНИК","СКАРЕД","СИЛКОМ","СИВКА","СЕМИТСКИЙ",
                                     "СЕДОВЛАСЫЙ","СДВОИТЬ","СВИНАРНИК","СВЕЖЕЗАМОРОЖЕННЫЙ","САХАРИСТЫЙ","САПФИРНЫЙ","САПОЖНЫЙ","САНЭПИДСТАНЦИЯ",
                                     "САМОХОД","САМОУСПОКОЕНИЕ","САМОГОН","САЛОТОПЕННЫЙ","СКОМОРОШЕСТВО","РЫКАТЬ","РАСКЛИНИТЬ","РАЗМОКРОПОГОДИТЬ",
                                     "РАЗЛАПИСТЫЙ","РАЗДРОБЛЕННЫЙ","РАДЖА","ПУСТЯКОВЫЙ","ПУСТОБРЁХ","ПУРПУРНЫЙ","ПРОХЛАДЕЦ","ПРОФУКАТЬ","ПРОТЕСТАНТИЗМ",
                                     "ПРОСТЫТЬ","ПРОСТРОГАТЬ","ПРОПЕРЧИТЬ","ПРОМЕШКАТЬ","ПРОКЛАЖАТЬСЯ","ПРОКАЗНИЧАТЬ","ПРИСТУПОК","ПРИСТРУНИТЬ",
                                     "ПРИСПОСОБЛЯЕМОСТЬ","ПРИСОСОК","ПРИГОРШНЯ","ПРИВОЗНОЙ","ПРЕДРАСПОЛОЖЕНИЕ","ПОСУДОМОЕЧНЫЙ","ПОСВИСТАТЬ","ПОРТЯЖНИЧАТЬ",
                                     "ПОРТКИ","ПОЛТОРА","ПОЛИЦЕЙМЕЙСТЕР","ПОДХАЛИМНИЧАТЬ","ПОБЛЁКЛЫЙ","ПЛЕШЬ","ПИСТОЛЬ","ПИСКЛИВЫЙ","ПИАЛА","ПЕШНЯ","ПЕРЧИТЬ",
                                     "ПЕРЕЧЕРКАТЬ","ПЕРЕСМЕНА","ПЕРЕНОСНЫЙ","ПЕРЕГРУЖЕННОСТЬ","ПЕРВОПУТОК","ПЕРВООЧЕРЕДНОЙ","ПАСТЕЛЬНЫЙ",
                                     "ПАРИЛЬНЯ","ПАМПАСЫ","ПРИВОЗНОЙ","ОЧИНЯТЬ","ОХЛОПЬЕ","ОТЧЕБУЧИТЬ","ОТТЯПАТЬ","ОТРЕПЬЕ","ОТОРИНОЛАРИНГОЛОГИЯ",
                                     "ОТОРИНОЛАРИНГОЛОГ","ОСТЫТЬ","ОРЕХОПЛОДНЫЙ","ОПОСРЕДОВАННЫЙ","ОПЕРЕТТА","ОГНЕПОКЛОННИЧЕСТВО","ОБСТРОГАТЬ",
                                     "ОБМУСЛИТЬ","НОРМИРОВАТЬ","НОЖНЫ","НОВОРОЖДЁННЫЙ","НИЗКОПОКЛОНСТВО","НЕУВЯДАЕМЫЙ","НЕПРОТИВЛЕНИЕ",
                                     "НЕЗЛОБИВЫЙ","НЕДВИЖИМЫЙ","НАЧЕРКАТЬ","НАСТРОГАТЬ","НАСТОРОЖЕННЫЙ","НАСТЛАТЬ","НАВЕСНОЙ","НАВОЛОЧКА",
                                     "МУСЛИТЬ","МУСКУЛИСТЫЙ","МУЛЬТИК","МОТОЦИКЛ","МОРДАСТЫЙ","МОЛДАВСКИЙ","МОДЕРНЫЙ","МИЛОСЕРДНЫЙ","МИЗЕРНЫЙ","МЕЛОЧИТЬ",
                                     "МЕЖДУГОРОДНЫЙ","МЕЖДОУСОБИЕ","МЕГРЕЛЬСКИЙ","МАТЁРЫЙ","МАРКИРОВАТЬ","МАЛЬЧИШЕСКИЙ","МАЛОЛЕТКА","МИНУТЬ",
                                     "ЛОСНИТЬСЯ","ЛЕМЕХ","ЛЕГАЛИЗОВАТЬСЯ","ЛЕГАЛИЗОВАТЬ","КРУЖНЫЙ","КРУГЛОГОДОВОЙ","КРЕМНИСТЫЙ","КРАСНОДЕРЕВЕЦ",
                                     "КОРОТКОВОЛНОВЫЙ","КОНЯГА","КОНОВЯЗЬ","КОЛОМЕНОК","КОЖЕВНИК","КОЕ-ЧТО","КОЕ-КУДА","КОЕ-КТО","КЛАВИША","КИТОБОЙНЫЙ",
                                     "КАТОЛИЦИЗМ","КАРМИННЫЙ","КАМЧАТЫЙ","КАМЕННОУГОЛЬНЫЙ","КАЙФОВАТЬ","КАВЕРЗИТЬ","ИСЧЕРКАТЬ",
                                     "ИСКРИТЬСЯ","ИСКРИСТЫЙ","ИНДУСТРИЯ","ИЛЛЮМИНИРОВАТЬ","ИКРОМЕТАНИЕ","ИЗРАИЛЬТЯНСКИЙ","ИЗБЕЖАТЬ",
                                     "ИЖОРЦЫ","ИДОЛОПОКЛОННИЧЕСТВО",
                                     "ЗУБОСКАЛИТЬ", "ЗЛЫДЕНЬ", "ЗАШЕЕК", "ЗАУСЕНЕЦ",
                                     "ЗАТОРМОЖЁННЫЙ", "ЗАСТРОГАТЬ", "ЗАСТЛАТЬ", "ЗАРОСЛЬ", "ЗАПЫХАТЬСЯ", "ЗАКЛИНИТЬ",
                                     "ЗАДАВАКА",
                                     "ЗАГРУЖЕННОСТЬ", "ЗАЛ", "ЖЁЛЧНЫЙ", "ЖЕМАНИТЬСЯ", "ЖАКЕТ","ДРЁМА","ДОЩАТЫЙ","ДОМОВНИЧАТЬ","ДОГОВОР",
                                     "ДЛИННОВОЛНОВЫЙ","ДИСКУТИРОВАТЬ","ДИНАМО","ДИЛЕТАНТИЗМ","ДЕКАТИРОВАТЬ","ДЕВЧОНОЧИЙ","ДЕБАРКАДЕР",
                                     "ГРИБОВАРОЧНЫЙ", "ГРЕЧА","ГЛИСТ","ГЕОРГИН","ГАРМОНИЗИРОВАТЬ","ГАИТЯНСКИЙ","ГАЗИРОВАТЬ","ГАЕРНИЧАТЬ",
                                     "ВЫСТЛАТЬ","ВСЁ-ТАКИ","ВПЕРЕГОНКИ","ВОРОТА","ВОЛЧИХА","ВОДООЧИСТНЫЙ","ВНУЧАТНЫЙ","ВКЛИНИТЬСЯ",
                                     "ВКЛИНИТЬ","ВАКХАЛЬНЫЙ","БРОНЯ","БРОДЯЖНИЧАТЬ","ВОЛЧИЦА","БРИЛЛИАНТ","БРЕТЕЛЬКА","БРЫЗГАТЬ",
                                     "БОТИКИ","БОРЖОМИ","БОДРЯЧЕСКИЙ","БЛЁКЛЫЙ","БИТУМЫ","БИЖУТЕРИЯ","БЕЛОДЕРЕВЕЦ","БЕЗВКУСИЦА",
                                     "БАСКСКИЙ","БАРЖА","БАКЕНБАРДЫ","БЛАГОПРИОБРЕТЕННЫЙ","АРОМАТНЫЙ","АКУШЕР","АБХАЗЫ","СЕГРЕГАЦИЯ",
                                     "ЭКЗАЛЬТИРОВАННЫЙ","ЩУРЁНОК","ШПАКЛЕВАТЬ","ТЕРРОРИЗИРОВАТЬ","ТАПОЧКИ","СТАНДАРТИЗИРОВАТЬ","СТАБИЛИЗИРОВАТЬ","САМОУПРАВСТВОВАТЬ","САЖЕНЬ",
                                     "РОМАНИЗИРОВАТЬ","РЖАВЕТЬ","РАЗОСТЛАТЬ","РАЗДЕВАЛЬНЯ","ПРЕУМЕНЬШИТЬ","ПОСЕРЁДКЕ","ПОПУЛЯРИЗИРОВАТЬ",
                                     "ПОДОСТЛАТЬ","ПЕРЕПЛАНИРОВАТЬ","ПАСМО","ОКИСЛИТЬ","ОДНОВРЕМЕННЫЙ","НЕОПОЗНАННЫЙ","СКОПИДОМНИЧАТЬ",
                                     "СКОВЫРНУТЬ","ОПОРОЖНИТЬ","НАСОЧИНИТЬ","МОТОРИЗИРОВАТЬ","МОДЕРНИЗИРОВАТЬ","МЕГРЕЛЫ","КОЛОНИЗОВАТЬ",
                                     "КАНОНИЗОВАТЬ","ГАИТЯНЕ","ВОЗДЕРЖАННЫЙ","ВЕЛИКОВОЗРАСТНЫЙ","ВДУНУТЬ",
                                     ):
                        fw.write(word)
                        fw.write(" ")
                        continue
                    if (clearedWord == '-СЯ'):
                        fw.write(word)
                        fw.write(" ")
                        continue
                    if len(clearedWord) > 2:
                        fw.write("\n")
                        fw.write(clearedWord)
                        fw.write(", ")
                    else:
                        fw.write(word)
                        fw.write(" ")
                else:
                    fw.write(word)
                    fw.write(" ")
            fw.write("\n")



def extractFirstWordFromLine(line):
    if len(line) == 0:
        return ""
    wordsInLine = line.strip().split(" ")
    firstWord = extractWordFromString(wordsInLine[0])
    return firstWord

def extractWordFromString(str):
    if len(str) == 0:
        return ""
    extractedWord = str.lstrip().rstrip(",:.123456789!")
    return extractedWord

def runner() -> None:
    workdir = os.environ.get('WORKDIR_PATH')
    outputdir = os.environ.get('OUTPPUTDIR_PATH')

    # 1. Заменяем все русские символы которые распознались как латиница на русские схожие по написанию.
    with open(outputdir + '/01.letters_replaced.txt', 'w', newline='') as fw:
        replaceSimilarLetters(fw, workdir + '/Ожегов_С._Толковый_словарь_русского_языка.txt', 'utf-8')
    fw.close()

    # 2. Просмотриваем каждую строку на предмет наличия в ней других слов
    with open(outputdir + '/02.extracted_hidden_words_vocabulary.txt', 'w', newline='') as fw:
        extractInlinedWords(fw, outputdir + '/01.letters_replaced.txt', 'utf-8')
    fw.close()

    # 3. Вычищаем из файла все пустые строки
    with open(outputdir + '/03.compressed_vocabulary.txt', 'w', newline='') as fw:
        dropEmptyLines(fw, outputdir + '/02.extracted_hidden_words_vocabulary.txt', 'utf-8')
    fw.close()

    # 4. Слепить вместе строки которые жизнь разбросала по разным линиям
    with open(outputdir + '/04.concat_lines.txt', 'w', newline='') as fw:
        concatLines(fw, 4, outputdir + '/03.compressed_vocabulary.txt', 'utf-8')
    fw.close()

    # 5. Выводим подозрительные слова
    findInconsistencies(outputdir + '/04.concat_lines.txt', 4, 'utf-8')

    # 6. Засовываем всё что напарсили в БД
    try:
        with psycopg2.connect(
                dbname="words",
                user="postgres",
                password="password",
                host="172.17.0.1",
                port="5432"
        ) as conn:
            with conn.cursor() as cur:
                try:
                    with open(outputdir + '/04.concat_lines.txt', 'rt', encoding='utf-8') as fr:
                        for i in range(4):
                            fr.readline()
                        counter = 0
                        for line in fr:
                            word = extractFirstWordFromLine(line)
                            cur.execute("INSERT INTO public.ojegov(word, explanation) VALUES (lower(%s), %s);", (word, line[len(word):].lstrip(',').strip()))
                            counter = counter + 1
                            if counter % 100 == 0:
                                conn.commit()
                                print(f"Committed transaction after: {counter}")
                        conn.commit()
                except Error as e:
                    conn.rollback()
                    print(f"Transaction failed: {e.pgcode} - {e.pgerror}")
    except Exception as e:
        print(f"The error has occurred. Details: {e}")

if __name__ == '__main__':
    runner()